# GetViewId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElevationMarker..::..GetViewId Method
ElevationMarker Class See Also
---
Returns the ViewSection id for the index of the ElevationMarker.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId GetViewId(
	int index
)
```

Visual Basic
---
```text
Public Function GetViewId ( _
	index As Integer _
) As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetViewId(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the ElevationMarker for which a ViewSection id will be returned.
# ### Return Value
ViewSection id of the view at the ElevationMarker index, invalid element id otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The index index is out of range for this ElevationMarker. |

# See Also
ElevationMarker Class
Autodesk.Revit.DB Namespace